Revit 2024 API
STLImportOptions Constructor (STLImportOptions)
 Constructs a new instance of STLImportOptions as a copy of the import options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022.1
Syntax
C#
public STLImportOptions(
	STLImportOptions option
)
Visual Basic
Public Sub New ( _
	option As STLImportOptions _
)
Visual C++
public:
STLImportOptions(
	STLImportOptions^ option
)
Parameters
option
Type: Autodesk.Revit.DB.STLImportOptions
 The STL options to be copied.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
STLImportOptions Class
STLImportOptions Overload
Autodesk.Revit.DB Namespace